# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [77]:
# import pandas library
import pandas as pd

# read the CSV file into a DataFrame
df_data = pd.read_csv('./Data/Purchase_Data.csv')

# display the first few rows of the DataFrame
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [78]:
# Display the data types of each column
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [79]:
# Select and display only the first two columns: "invoice_number" and "invoice_time"
result_1 = df_data.loc[: , ["invoice_number", "invoice_time"] ]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [80]:
# Select and display the first two rows of the DataFrame
result_2 = df_data.loc[[0,1] , : ]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [81]:
# Select and display the first four rows and five columns of the DataFrame
result_3 = df_data.iloc[0:4 , 0:5 ]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [82]:
# Select and display specific rows and columns of the DataFrame
result_4 = df_data.loc[[0,4,6] , ["invoice_time", "price"] ]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [83]:
# Number of rows
num_rows = df_data.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [84]:
# Display the last row of the DataFrame
last_row = df_data.loc[[num_rows - 1] , : ]
last_row

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [85]:
# Calculate the average and maximum price
avg_price = df_data['price'].mean()
max_price = df_data['price'].max()
print(f"average = {avg_price}\n maximum = {max_price}")

average = 3.1920522110741363
 maximum = 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [86]:
# Compute average price and average number of items using a single call to mean()
avg_price, avg_num_items = df_data[['price', 'num_item']].mean()

# Show the results
print(f"avg_price = {avg_price} \navg_num_items = {avg_num_items}")

avg_price = 3.1920522110741363
avg_num_items = 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [87]:
# Create a new column "total" that is the product of "price" and "num_items"
df_data["total"] = df_data["price"] * df_data["num_item"]
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [88]:
# Compute the average price of the three most expensive purchases
# Use nlargest to get the top 3 prices and then take the mean
top3_price = df_data['price'].nlargest(3)
avg_price_top3 = top3_price.mean()
print(f"Avg of top 3 price = {avg_price_top3}")

Avg of top 3 price = 6.003333333333333

How many different products are there?

In [89]:
# Find all unique product IDs in the "product_id" column
product = df_data["product_id"].unique()
product

array([ 7000300,  7070884,  7070891,  7090363,  7000126,  7308017,
       15000231,  7071096,  7000133,  7071133,  7314599,  7000294,
        7313684,  7071218,  7314612,  7090370, 21000782, 30000742,
        7308765,  7000140,  7070969, 21000430,  7000034,  7000423,
       21050107, 20098391, 30000759, 30000766,  7000409,  7090097,
        7071102,  7071140,  7071164,  7000416, 21000447, 21000379,
       21000362, 30000711,  7090462,  7090509,  7071331, 21050060,
       21050022,  7090455,  7090592, 23030206,  7090493,  7071256,
        7071249,  7090486,  7090479,  7071232,  7090615])

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [90]:
# Display summary statistics of the DataFrame
mean_total = df_data.describe().loc["mean" , "total"]
median_total = df_data.describe().loc["50%" , "total"]
diff = mean_total - median_total
print(f"mean_total = {mean_total}\nmedian_total = {median_total}\ndiff = {diff}")

mean_total = 3.931807878112784
median_total = 3.0
diff = 0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [91]:
# Drop the "total" column from the DataFrame
df_data.drop("total", axis=1, inplace=True)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

### Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [92]:
# Change invoice_time column to datetime data type
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'], errors='coerce', infer_datetime_format=True)
df_data.info()

C:\Users\HP\AppData\Local\Temp\ipykernel_24768\2167138376.py:2: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'], errors='coerce', infer_datetime_format=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_24768\2167138376.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'], errors='coerce', infer_datetime_format=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5382 entries, 0 to 5381
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  5382 non-null   float64
 1   invoice_time    5382 non-null   datetime64[ns]
 2   store_id        5382 non-null   object
 3   product_id      5382 non-null   int64
 4   category_id     5382 non-null   int64
 5   num_item        5382 non-null   float64
 6   price           5382 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(2), object(1)
memory usage: 294.5+ KB

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [93]:
# Create DOW and Month columns
df_data['DOW'] = df_data['invoice_time'].dt.day_name()
df_data['Month'] = df_data['invoice_time'].dt.month_name()

# Check first few rows
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,July
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,July
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [94]:
# Count purchases by day of week
num_purchases_wed = df_data['DOW'].value_counts()['Wednesday']

print("Number of purchases made on Wednesday:", num_purchases_wed)

Number of purchases made on Wednesday: 959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [95]:
# Read Titanic dataset
df = pd.read_csv('./Data/Titanic.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [96]:
# Rename columns 'Name' to 'Passenger_Name' and 'Ticket' to 'Ticket_Num'
df = df.rename(columns={'Name':'Passenger_Name', 'Ticket' : 'Ticket_Num'})
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [97]:
# Change the index
d = df.set_index("PassengerId")
d

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

Select the name of passenger 896

In [98]:
#Write your code here
df[df["PassengerId"] == 896]["Passenger_Name"]

# or by using new dataframe with new index
# d.loc[896]["Passenger_Name"]

4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Name: Passenger_Name, dtype: object

How many missing entries are there in the Age column?

In [99]:
#Write you code here
num_of_null = df["Age"].isnull().sum()

Compute the avg age of passengers ignoring the missing data.

In [100]:
#Write your code here
avg_Age = df["Age"].mean()

Using the fillna() method replace the missing values in the Age column with the mean.

In [101]:
#Write your code here
df["Age"] = df["Age"].fillna(avg_Age)